[ADD_ABILITY.A_t3_citadel H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="龙族活力"
mTooltip="英雄军队中的蜻蜓和龙蛇拥有 %buff.buff.stat1 %buff.buff.stat1.icon 防御、%buff.buff.stat2 %buff.buff.stat2.icon 生命值，并获得 %spell3.name 技能。"

[ADD_ABILITY.A_t3_citadel_Buff H7BaseBuff]
mName=""
mTooltip=""

[ADD_vitality.A_t2_dresseur H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="坚实蜕皮"
mTooltip="该英雄使图腾怪和偶像者的生命值提高 %buff1.buff.stat1 %icon_health，并且这些生物总是进行最大射程攻击。"

[ADD_vitality.A_t2_Dresseur_Buff H7BaseBuff]
mName="坚实蜕皮"
mTooltip="%stat1 %icon_health 加成，此生物总是进行最大射程攻击。"

[CreatureGrowthBonus.A_t1_citadel_growth H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="山脊首领"
mTooltip="总督：该城镇控制区域内铁脊怪和钢脊怪的周产量增加 %buff1.buff.stat。"

[CreatureGrowthBonus.A_t1_citadel_growth_Buff H7BaseBuff]
mName=""
mTooltip=""

[CreatureGrowthBonus.A_t2_growth H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="筑巢"
mTooltip="总督：该城镇控制区域内图腾怪和偶像者的周产量增加 %buff1.buff.stat。"

[CreatureGrowthBonus.A_t2_growth_Buff H7BaseBuff]
mName=""
mTooltip=""




[temple_spe.A_Tyran_master H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="暴龙赐福"
mTooltip="“暴龙”和“覆甲暴龙”生物在每场战斗开始时获得 %buff1.buff.stat 生命值 %icon_health 和 %spell2.name 技能。"

[temple_spe.A_Tyran_master_Buff H7BaseBuff]
mName="进攻术"
mTooltip="该生物的伤害提高 %stat1。"
____________________________________________



[temple_spe.A_mue_oroboros_up H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="衔尾蛇强化蜕皮"
mTooltip="当 %spell3.name 触发时，复活效果翻倍。"

[temple_spe.A_mue_oroborosup_Buff H7BaseBuff]
mName="魔力削弱"
mTooltip="英雄每次对友方单位造成伤害时，其魔力降低 %stat1。"

[temple_spe.A_mue_oroborosup_Buff_creature H7BaseBuff]
mName="魔力削弱"
mTooltip="英雄每次对友方单位造成伤害时，其魔力降低 %stat1。"

[temple_spe.A_Mue_Solide_ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="坚实蜕皮"
mTooltip="只要友方生物处于 %spell4.name 或 %spell5.name 效果下，它们就获得 %buff1.buff.stat1 %icon_attack 和 %icon_defense。"

[temple_spe.A_Mue_Solide_Buff H7BaseBuff]
mName=""
mTooltip=""

[temple_spe.A_poison_atrofique_Buff H7BaseBuff]
mName="凶恶毒液"
mTooltip="生物造成 %stat1 伤害，持续 %durnow 回合。"

[temple_spe.A_Poison_datrofi_ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="凶恶毒液"
mTooltip="只要敌方生物处于 %spell4.name 效果下，它们造成的伤害减少 %buff1.buff.stat1（对亡灵和构装体单位无效）"

_____________________

Version 1.34 : 


[golem_invo.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔像创造"
mTooltip="允许英雄召唤目标魔像或沙岩魔像生物堆栈的 %special1.val2%，每场战斗一次。"

[golem_invo.A_no_goleme_unskill_creature H7BaseBuff]
mName="魔像创造冷却"
mTooltip=""

version 1.35

[temple_spe.A_T4_trainer H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="蜥蜴人附属酋长"
mTooltip="英雄军队中的蜥蜴人和蜥蜴人战士拥有 %buff.buff.stat1 %buff.buff.stat1.icon 防御、%buff.buff.stat2 %buff.buff.stat2.icon 生命值，并获得 %spell3.name 技能。（每当该生物受到敌方生物的远程攻击伤害时，它会获得伤害、移动力加成，并且免疫负面精神效果，直到其下一回合结束）。"
